Развернуть две виртуальные машины (кто еще не сделал, можно последовательно)
- Ubuntu
- Centos

Затем:
Ubuntu
1. Произвести минимальную настройку (время, локаль, custom motd)
[screenshot] (https://github.com/Flyn88/PNG/blob/main/Data.png)
2. Определить точную версию ядра.
3. Вывести список модулей ядра и записать в файл
4. Просмотреть информацию о процессоре и модулях оперативной памяти
5. Получить информацию о жестком диске
6. Добавить в виртуальную машину второй сетевой интерфейс (вывести информацию о нем в виртуалках)
7. (**) Узнать полную информацию об использованной и неиспользованной памяти
8. (**) Создать пользователя new_admin_user, Настроить ssh доступ пользователю по ключу на VM, запретить ему авторизацию по паролю
9. (**) Вывести список файловых систем, которые поддерживаются ядром

Centos
1. Произвести минимальную настройку (время, локаль, custom motd)

2. Определить точную версию ядра.
3. Вывести список модулей ядра и записать в файл
4. Просмотреть информацию о процессоре и модулях оперативной памяти
5. Получить информацию о жестком диске
6. Добавить в виртуальную машину второй сетевой интерфейс (вывести информацию о нем в виртуалках)
7. (**) Узнать полную информацию об использованной и неиспользованной памяти
8. (**) Создать пользователя new_admin_user, Настроить ssh доступ пользователю по ключу на VM, запретить ему авторизацию по паролю
9. (**) Вывести список файловых систем, которые поддерживаются ядром

